%% rotor_parameters.m
% 该程序对转子系统进行参数设置
function[N,density,Ef,L,R,RO,miu]=case_parameters
% N: 划分的轴段数
% density: 轴的密度 单位为：[kg/m~3]
% Ef: 轴的弹性模量 单位为：[Pa]
% L： 每个轴段的长度 单位为：[m]
% R: 每个轴段的外半径 单位为：[m]
% RO: 每个轴段的内半径 单位为：[m]
% miu: 每个轴段的单元质量 [kg/m]
N=16;
density=7800;
Ef=[ 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 2.1 ]*1e11;
L=[ 30 107 20.5 40.5 99 115.25 115.25 82 70 102.02 66.98 58 23 98.5 58.5 42.5 ]/1000;
R=[ 160 160 180 210 178.4 162.9 162.9 174.4 194 168 168 199.5 346.5 168 168 162.9 ]/1000;
RO=[ 126 126 126 126 152.4 152.4 152.4 152.4 152.4 152.4 152.4 152.4 152.1 152.4 152.4 152.4 ]/1000;
% R=[ 150 150 150 150 150 150 150 150 150 ]/1000;
% RO=[ 100 100 100 100 100 100 100 100 100 ]/1000;
for i=1:1:N
    miu(i)=density*pi*(R(i)^2-RO(i)^2);
end